# Parameters
nc: 6  # number of classes
depth_multiple: 0.33
width_multiple: 0.50


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, CSCA, [256]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 1, CSCA, [512]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CSCA, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 12

#-------------------------------------------------------------------------------------#
# MSSFPN
head:
  - [5, 1, Conv, [128, 3, 1]] # 13
  - [8, 1, Conv, [256, 3, 1]] # 14

  - [[13,14], 1, ASFF2, [64,[64,128],0]]  # 15
  - [[13,14], 1, ASFF2, [128,[64,128],1]]  # 16

  - [[13,15], 1, FSF, [64]]  # 17
  - [[14,16], 1, FSF, [128]]  # 18

  - [17, 1, C2f_RepViTBlock, [128]]  # 19
  - [18, 1, C2f_RepViTBlock, [256]]  # 20 
  - [12, 1, Conv, [512, 3, 1]] # 21

  - [[19,20,21], 1, ASFF3, [64,[64,128,256],0]] # 22
  - [[19,20,21], 1, ASFF3, [128,[64,128,256],1]]  # 23
  - [[19,20,21], 1, ASFF3, [256,[64,128,256],2]]  # 24
 
  - [[19,22], 1, FSF, [64]]  # 25
  - [[20,23], 1, FSF, [128]]  # 26
  - [[21,24], 1, FSF, [256]]  # 27

  - [25, 3, C2f_RepViTBlock, [256]] # 28
  - [26, 3, C2f_RepViTBlock, [512]] # 29
  - [27, 3, C2f_RepViTBlock, [1024]] # 30
#-------------------------------------------------------------------------------------#


  - [[28, 29, 30], 1, Detect, [nc]]  # 31
