# Parameters
nc: 6  # number of classes
depth_multiple: 0.33
width_multiple: 0.50


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]       # 0
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 3, CSCA, [256]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 3, CSCA, [512]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 3, CSCA, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 13

head:
  - [6, 1, Conv, [128, 3, 1]] # 14
  - [9, 1, Conv, [256, 3, 1]] # 15

  - [[14,15], 1, ASFF2, [64,[64,128],0]]  # 16
  - [[14,15], 1, ASFF2, [128,[64,128],1]]  # 17

  - [[14,16], 1, FSF, [64]]  # 18
  - [[15,17], 1, FSF, [128]]  # 19

  - [18, 1, C2f_RepViTBlock, [128]]  # 20
  - [19, 1, C2f_RepViTBlock, [256]]  # 21 
  - [13, 1, Conv, [512, 3, 1]] # 22

  - [[20,21,22], 1, ASFF3, [64,[64,128,256],0]] # 23
  - [[20,21,22], 1, ASFF3, [128,[64,128,256],1]]  # 24
  - [[20,21,22], 1, ASFF3, [256,[64,128,256],2]]  # 25
 
  - [[20,23], 1, FSF, [64]]  # 26
  - [[21,24], 1, FSF, [128]]  # 27
  - [[22,25], 1, FSF, [256]]  # 28

  - [26, 3, C2f_RepViTBlock, [256]] # 29
  - [27, 3, C2f_RepViTBlock, [512]] # 30
  - [28, 3, C2f_RepViTBlock, [1024]] # 31


#----------------------------------------------------------------#
#  AGB

#  Link module
  - [14, 1, Link, [[128]]] # 32
  - [15, 1, Link, [[128,256]]] # 33
  - [22, 1, Link, [[128,256,512]]] # 34


  - [0, 1, Conv, [64, 3, 2]]  # 35-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 36-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 38-P3/8
  - [-1, 3, CSCA, [256]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 41-P4/16
  - [-1, 3, CSCA, [512]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 44-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 3, CSCA, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 47

#   Fuse  module
  - [[32, 33, 34, 40], 3, Fuse, [[0, 0, 0]]] # 48
  - [[33, 34, 43], 3, Fuse, [[1, 1]]] # 49
  - [[34, 47], 3, Fuse, [[2]]] # 50

  - [48, 1, Conv, [128, 3, 1]] # 51
  - [49, 1, Conv, [256, 3, 1]] # 52
  - [50, 1, Conv, [512, 3, 1]] # 53




  - [[51, 52, 53, 29, 30, 31], 1, Detect, [nc]]  # 54